europamundobd/reserva14/reservaRQ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
<soapenv:Header/>
<soapenv:Body>
  <tem:setPreReserva>
    <tem:Localizador>XXXVV85</tem:Localizador>
    <tem:Fecha>20200414</tem:Fecha>
    <tem:ID_Viaje>17888</tem:ID_Viaje>
    <tem:Rotativo>N</tem:Rotativo>
    <tem:Sector>S</tem:Sector>
    <tem:Paradas>S</tem:Paradas>
    <tem:Ciudad_Incorporacion>2</tem:Ciudad_Incorporacion>
    <tem:Ciudad_Finalizacion>9</tem:Ciudad_Finalizacion>
    <tem:Ciudad_Parada>7</tem:Ciudad_Parada>
    <tem:Tiempo_Parada>7</tem:Tiempo_Parada>
    <tem:Plazas>3</tem:Plazas>
    <tem:PlazasAdulto>2</tem:PlazasAdulto>
    <tem:PlazasNinio>1</tem:PlazasNinio>
    <tem:Pasajeros>
    	<tem:ArrayOfString>
        <tem:string>Juarez</tem:string>
        <tem:string>Xavier Jose</tem:string>
        <tem:string>30</tem:string>
        <tem:string>adulto</tem:string>
        <tem:string>H</tem:string>
        <tem:string>S</tem:string>
        <tem:string>N</tem:string>
        <tem:string></tem:string>
        <tem:string>N</tem:string>
        <tem:string>1122331d</tem:string>
        <tem:string>1122331p</tem:string>
        <tem:string>20000919</tem:string>
        <tem:string>italiana</tem:string>
      </tem:ArrayOfString>
      <tem:ArrayOfString>
        <tem:string>Juarez</tem:string>
        <tem:string>Maria Jose</tem:string>
        <tem:string>25</tem:string>
        <tem:string>adulto</tem:string>
        <tem:string>M</tem:string>
        <tem:string>S</tem:string>
        <tem:string>N</tem:string>
        <tem:string></tem:string>
        <tem:string>N</tem:string>
        <tem:string>1122332d</tem:string>
        <tem:string>1122332p</tem:string>
        <tem:string>20000909</tem:string>
        <tem:string>italiana</tem:string>
      </tem:ArrayOfString>
      <tem:ArrayOfString>
        <tem:string>Juarez</tem:string>
        <tem:string>Julian Jose</tem:string>
        <tem:string>7</tem:string>
        <tem:string>Nino</tem:string>
        <tem:string>H</tem:string>
        <tem:string>S</tem:string>
        <tem:string>N</tem:string>
        <tem:string></tem:string>
        <tem:string>N</tem:string>
        <tem:string>1122331d</tem:string>
        <tem:string>1122331p</tem:string>
        <tem:string>19800314</tem:string>
        <tem:string>italiana</tem:string>
      </tem:ArrayOfString>
    </tem:Pasajeros>
    <tem:Observaciones>texto obsv</tem:Observaciones>
    <tem:NOCHES_ADICIONALES_INICIO>1</tem:NOCHES_ADICIONALES_INICIO>
    <tem:NOCHES_ADICIONALES_FINAL>0</tem:NOCHES_ADICIONALES_FINAL>
    <tem:Observaciones_Bono>lo que me da la gana</tem:Observaciones_Bono>
    <tem:TrasladoLlegada>
      <tem:CO_RESERVA></tem:CO_RESERVA>
      <tem:TIPO_TRASLADO>S</tem:TIPO_TRASLADO>
      <tem:MODIFICACION>0</tem:MODIFICACION>
      <tem:FECHA>20200414</tem:FECHA>
      <tem:CIUDAD>Madrid</tem:CIUDAD>
      <tem:OPCION_ELEGIDA>FD</tem:OPCION_ELEGIDA>
      <tem:NUM_VUELO></tem:NUM_VUELO>
      <tem:COMPANYA_AEREA></tem:COMPANYA_AEREA>
      <tem:AEROPUERTO></tem:AEROPUERTO>
      <tem:CIUDAD_PROC_DEST></tem:CIUDAD_PROC_DEST>
      <tem:NOMBRE_HOTEL></tem:NOMBRE_HOTEL>
      <tem:DIRECCION_HOTEL></tem:DIRECCION_HOTEL>
      <tem:HORA_RECOGIDA></tem:HORA_RECOGIDA>
      <tem:HOTEL_RECOGIDA></tem:HOTEL_RECOGIDA>
      <tem:ID_HOTEL></tem:ID_HOTEL>
      <tem:DIRECCION_LLEGADA></tem:DIRECCION_LLEGADA>
      <tem:DIRECCION_DESTINO></tem:DIRECCION_DESTINO>
      <tem:OPC_FALTAN_DAT>PD</tem:OPC_FALTAN_DAT>
      <tem:MODIFICADO_MENOS_48H></tem:MODIFICADO_MENOS_48H>
      <tem:IDAGENTE_MODIFICACION>0</tem:IDAGENTE_MODIFICACION>
      <tem:FECHA_MODIFICACION></tem:FECHA_MODIFICACION>
    </tem:TrasladoLlegada>
    <tem:TrasladoSalida>
      <tem:CO_RESERVA></tem:CO_RESERVA>
      <tem:TIPO_TRASLADO>N</tem:TIPO_TRASLADO>
      <tem:MODIFICACION>0</tem:MODIFICACION>
      <tem:FECHA>20200425</tem:FECHA>
      <tem:CIUDAD>Barcelona</tem:CIUDAD>
      <tem:OPCION_ELEGIDA>FD</tem:OPCION_ELEGIDA>
      <tem:NUM_VUELO></tem:NUM_VUELO>
      <tem:COMPANYA_AEREA></tem:COMPANYA_AEREA>
      <tem:AEROPUERTO></tem:AEROPUERTO>
      <tem:CIUDAD_PROC_DEST></tem:CIUDAD_PROC_DEST>
      <tem:NOMBRE_HOTEL></tem:NOMBRE_HOTEL>
      <tem:DIRECCION_HOTEL></tem:DIRECCION_HOTEL>
      <tem:HORA_RECOGIDA></tem:HORA_RECOGIDA>
      <tem:HOTEL_RECOGIDA></tem:HOTEL_RECOGIDA>
      <tem:ID_HOTEL></tem:ID_HOTEL>
      <tem:DIRECCION_LLEGADA></tem:DIRECCION_LLEGADA>
      <tem:DIRECCION_DESTINO></tem:DIRECCION_DESTINO>
      <tem:OPC_FALTAN_DAT>PD</tem:OPC_FALTAN_DAT>
      <tem:MODIFICADO_MENOS_48H></tem:MODIFICADO_MENOS_48H>
      <tem:IDAGENTE_MODIFICACION>0</tem:IDAGENTE_MODIFICACION>
      <tem:FECHA_MODIFICACION></tem:FECHA_MODIFICACION>
    </tem:TrasladoSalida>
    <tem:userName>CTMWS</tem:userName>
    <tem:userPassword>Ctmws123</tem:userPassword>
  </tem:setPreReserva>
</soapenv:Body>
</soapenv:Envelope>